/*
╭ ◜◝ ͡ ◜◝ ͡ ◜◝ ͡ ◜◝ ͡ ◝╮
♡ ᵘ ᵐᵃᵏᵉ ᵐᵉ ˢᵒ ʰᵃᵖᵖʸ ♡
♡ ᶦ’ᵐ ᵍˡᵃᵈ ᶦ ℋᵃᵛᵉ ᵘ
╰ ◟◞ ͜ ◟ ͜ ◟◞ ͜ ◟ ͜ ◞ ╯
O ° 〃∩　∧＿∧
⊂⌒（ ´・ω・）
ヽ_っ＿/￣￣￣/ 　 　
　　＼/＿＿＿/
*/
//=================================================//
const fs = require("fs")
const chalk = require("chalk")
//=================================================//
global.Frenzy = ['6289632051115'] //-- Owner Core
global.Zyra = ['6289527058808'] //-- Helpers
global.Frenzyname = ['𝙵𝚛𝚎𝚗𝚣𝚢'] //-- Owner Name
global.Zyraname = ['𝙵𝚛𝚎𝚗𝚉𝚢𝚛𝚊-𝙼𝙳'] //-- Bot Name
//=================================================//
global.owner = ["6289632051115"]
global.author = ""
global.packname = "꒷︶꒷꒥꒷ ‧₊˚ ꒰ฅ˘ 𝙵𝚛𝚎𝚗𝚉𝚢𝚛𝚊 ˘ฅ ꒱ ‧₊˚꒷︶꒷꒥꒷"
global.sessionName = "XD"
global.versionbot = "2.6" //-- Version [^2.6] Latest!
//=================================================//
global.mess = {
Limit: '*⚠︎ 𝙾𝙿𝚂𝚂𝚂!... 𝙻𝙸𝙼𝙸𝚃 𝙰𝙽𝙳𝙰 𝚃𝙴𝙻𝙰𝙷 𝙳𝙸𝙶𝚄𝙽𝙰𝙺𝙰𝙽 𝚂𝙴𝙻𝚄𝚁𝚄𝙷𝙽𝚈𝙰, 𝚂𝙸𝙻𝙰𝙷𝙺𝙰𝙽 𝙺𝙴𝙼𝙱𝙰𝙻𝙸 𝙻𝙰𝙶𝙸 𝙴𝚂𝙾𝙺!...',
Done: '*⚠︎ 𝙳𝙾𝙽𝙴!...*',
Subscribe: '*⚠︎ 𝙵𝙴𝙰𝚃𝚄𝚁𝙴 𝙾𝙽𝙻𝚈 𝙵𝙾𝚁* _*𝚂𝚄𝙱𝚂𝙲𝚁𝙸𝙱𝙴𝚁𝚂 𝚄𝚂𝙴𝚁*_',
Basic: '*⚠︎ 𝙵𝙴𝙰𝚃𝚄𝚁𝙴 𝙾𝙽𝙻𝚈 𝙵𝙾𝚁* _*𝙱𝙰𝚂𝙸𝙲 𝚄𝚂𝙴𝚁*_',
Premium: '*⚠︎ 𝙵𝙴𝙰𝚃𝚄𝚁𝙴 𝙾𝙽𝙻𝚈 𝙵𝙾𝚁* _*𝙿𝚁𝙴𝙼𝙸𝚄𝙼 𝚄𝚂𝙴𝚁*_',
Nitro: '*⚠︎ 𝙵𝙴𝙰𝚃𝚄𝚁𝙴 𝙾𝙽𝙻𝚈 𝙵𝙾𝚁* _*𝙽𝙸𝚃𝚁𝙾 𝚄𝚂𝙴𝚁*_',
Admin: '*⚠︎ 𝙵𝙴𝙰𝚃𝚄𝚁𝙴 𝙾𝙽𝙻𝚈 𝙵𝙾𝚁* _*𝙰𝙳𝙼𝙸𝙽 𝙶𝚁𝙾𝚄𝙿*_',
UnAdmin: '*⚠︎ 𝙷𝙰𝚁𝙰𝙿 𝙼𝙴𝙽𝙶𝚄𝙱𝙰𝙷 𝚂𝚃𝙰𝚃𝚄𝚂 𝙱𝙾𝚃 𝙼𝙴𝙽𝙹𝙰𝙳𝙸* _*𝙰𝙳𝙼𝙸𝙽 𝙶𝚁𝙾𝚄𝙿*_ *𝚃𝙴𝚁𝙻𝙴𝙱𝙸𝙷 𝙳𝙰𝙷𝚄𝙻𝚄!...*',
FrenZyra: '*⚠︎ 𝙵𝙴𝙰𝚃𝚄𝚁𝙴 𝙾𝙽𝙻𝚈 𝙵𝙾𝚁* _*𝙳𝙴𝚅𝙴𝙻𝙾𝙿𝙴𝚁𝚂 𝙱𝙾𝚃*_',
Group: '*⚠︎ 𝙵𝙴𝙰𝚃𝚄𝚁𝙴 𝙾𝙽𝙻𝚈 𝙵𝙾𝚁* _*𝙶𝚁𝙾𝚄𝙿 𝙲𝙷𝙰𝚃*_',
Private: '*⚠︎ 𝙵𝙴𝙰𝚃𝚄𝚁𝙴 𝙾𝙽𝙻𝚈 𝙵𝙾𝚁* _*𝙿𝚁𝙸𝚅𝙰𝚃𝙴 𝙲𝙷𝙰𝚃*_',
Wait: '*⚠︎ 𝙿𝙻𝙴𝙰𝚂𝙴 𝚆𝙰𝙸𝚃 𝙰 𝙼𝙾𝙼𝙴𝙽𝚃!...*',
Error: '*⚠ 𝚂𝙴𝙿𝙴𝚁𝚃𝙸𝙽𝚈𝙰 𝚃𝙴𝚁𝙹𝙰𝙳𝙸 𝙴𝚁𝚁𝙾𝚁 𝚈𝙰𝙽𝙶 𝚃𝙸𝙳𝙰𝙺 𝚃𝙴𝚁𝙳𝚄𝙶𝙰!...*'
}
//=================================================//
let file = require.resolve(__filename);
fs.watchFile(file, () => {
  fs.unwatchFile(file);
  console.log(chalk.redBright(`𝚄𝚙𝚍𝚊𝚝𝚎 ${__filename}`));
  delete require.cache[file];
  require(file);
});